app/views/pages/_form.html.erb

    <%= f.label :type_id %><br />
		<%= select("page", "type_id", Type.all.collect {|p| [p.name, p.id] }) %>
---
SELECT "types".* FROM "types"