app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."name" = 'home' LIMIT 1
---
  def home
    @page = Page.where(:name => "home").limit(1)

SELECT "pages".* FROM "pages" WHERE "pages"."name" = 'home' LIMIT 1
SELECT "pages".* FROM "pages" WHERE "pages"."id" = 1 LIMIT 1
---
  def show
    if params[:name]
      @page = Page.where(:name => params[:name]).limit(1)
      @page = @page[0]
    elsif params[:id].to_s.match(/\A[+-]?\d+?(\.\d+)?\Z/) == nil
      @page = Page.where(:name => params[:id]).limit(1)
		  @page = @page[0]
    else
      @page = Page.find(params[:id])

SELECT "types".* FROM "types"
---
  def new
    @page = Page.new
		@types = Type.all

SELECT "pages".* FROM "pages" WHERE "pages"."id" = 1 LIMIT 1
SELECT "types".* FROM "types"
---
  def edit
    @page = Page.find(params[:id])
		@types = Type.all

INSERT INTO "pages" ("type_id", "sorting", "text", "updated_at", "created_at", "name") VALUES (2, 2, 'Workbook', '2011-05-24 12:22:23.611567', '2011-05-24 12:22:23.611567', 'workbook')
---
  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save