app/controllers/types_controller.rb

  def index
    @types = Type.all
---
SELECT "types".* FROM "types"

  def show
    @type = Type.find(params[:id])
---
SELECT "types".* FROM "types" WHERE "types"."id" = 1 LIMIT 1

  def create
    @type = Type.new(params[:type])

    respond_to do |format|
      if @type.save
---
INSERT INTO "types" ("updated_at", "created_at", "name") VALUES ('2011-05-24 12:13:07.684004', '2011-05-24 12:13:07.684004', 'static')